Revit 2026 API

# GradientGradientNoisePhase Property

---

The property labeled "Phase" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoisePhase { get; }
```
```vb
Public Shared ReadOnly Property GradientNoisePhase As String
	Get
```
```cpp
public:
static property String^ GradientNoisePhase {
	String^ get ();
}
```
```fsharp
static member GradientNoisePhase : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace